handsOn/flowOverCylinder/blockMeshAdvanced/Allrun
#!/bin/bash
#
# run the case

./meshIt

./run

./post
