handsOn/flowOverCylinder/blockMeshAdvanced/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration     | Version:  2.1.x                                 |
|   \  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
	version		2.0;
	format		ascii;
	class		dictionary;
	object		blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //




convertToMeters 1.0;


vertices
(
	( 0.0 -0.5 0.0 )	 // x0y0z0 = 0
	( 0.0 -0.5 0.01 )	 // x0y0z1 = 1
	( 0.0 -0.25 0.0 )	 // x0y1z0 = 2
	( 0.0 -0.25 0.01 )	 // x0y1z1 = 3
	( 0.0 0.0 0.0 )	 // x0y2z0 = 4
	( 0.0 0.0 0.01 )	 // x0y2z1 = 5
	( 0.0 0.25 0.0 )	 // x0y3z0 = 6
	( 0.0 0.25 0.01 )	 // x0y3z1 = 7
	( 0.0 0.5 0.0 )	 // x0y4z0 = 8
	( 0.0 0.5 0.01 )	 // x0y4z1 = 9
	( 0.15000000000000002 -0.5 0.0 )	 // x1y0z0 = 10
	( 0.15000000000000002 -0.5 0.01 )	 // x1y0z1 = 11
	( 0.15000000000000002 -0.25 0.0 )	 // x1y1z0 = 12
	( 0.15000000000000002 -0.25 0.01 )	 // x1y1z1 = 13
	( 0.09822330470336316 3.6956986395229244e-17 0.0 )	 // x1y2z0 = 14
	( 0.09822330470336316 3.6956986395229244e-17 0.01 )	 // x1y2z1 = 15
	( 0.15000000000000002 0.25 0.0 )	 // x1y3z0 = 16
	( 0.15000000000000002 0.25 0.01 )	 // x1y3z1 = 17
	( 0.15000000000000002 0.5 0.0 )	 // x1y4z0 = 18
	( 0.15000000000000002 0.5 0.01 )	 // x1y4z1 = 19
	( 0.4 -0.5 0.0 )	 // x2y0z0 = 20
	( 0.4 -0.5 0.01 )	 // x2y0z1 = 21
	( 0.39999999999999997 -0.30177669529663687 0.0 )	 // x2y1z0 = 22
	( 0.39999999999999997 -0.30177669529663687 0.01 )	 // x2y1z1 = 23
	( 0.4 0.0 0.0 )	 // x2y2z0 = 24
	( 0.4 0.0 0.01 )	 // x2y2z1 = 25
	( 0.4 0.30177669529663687 0.0 )	 // x2y3z0 = 26
	( 0.4 0.30177669529663687 0.01 )	 // x2y3z1 = 27
	( 0.4 0.5 0.0 )	 // x2y4z0 = 28
	( 0.4 0.5 0.01 )	 // x2y4z1 = 29
	( 0.65 -0.5 0.0 )	 // x3y0z0 = 30
	( 0.65 -0.5 0.01 )	 // x3y0z1 = 31
	( 0.65 -0.25 0.0 )	 // x3y1z0 = 32
	( 0.65 -0.25 0.01 )	 // x3y1z1 = 33
	( 0.7017766952966369 0.0 0.0 )	 // x3y2z0 = 34
	( 0.7017766952966369 0.0 0.01 )	 // x3y2z1 = 35
	( 0.65 0.25 0.0 )	 // x3y3z0 = 36
	( 0.65 0.25 0.01 )	 // x3y3z1 = 37
	( 0.65 0.5 0.0 )	 // x3y4z0 = 38
	( 0.65 0.5 0.01 )	 // x3y4z1 = 39
	( 2.5 -0.5 0.0 )	 // x4y0z0 = 40
	( 2.5 -0.5 0.01 )	 // x4y0z1 = 41
	( 2.5 -0.25 0.0 )	 // x4y1z0 = 42
	( 2.5 -0.25 0.01 )	 // x4y1z1 = 43
	( 2.5 0.0 0.0 )	 // x4y2z0 = 44
	( 2.5 0.0 0.01 )	 // x4y2z1 = 45
	( 2.5 0.25 0.0 )	 // x4y3z0 = 46
	( 2.5 0.25 0.01 )	 // x4y3z1 = 47
	( 2.5 0.5 0.0 )	 // x4y4z0 = 48
	( 2.5 0.5 0.01 )	 // x4y4z1 = 49

	( 0.42500000000000004 0.0 0.0 )	 // a0h0 = 50
	( 0.5625 0.0 0.0 )	 // b0h0 = 51
	( 0.41767766952966373 0.017677669529663688 0.0 )	 // a1h0 = 52
	( 0.514904851942814 0.11490485194281397 0.0 )	 // b1h0 = 53
	( 0.4 0.025 0.0 )	 // a2h0 = 54
	( 0.4 0.1625 0.0 )	 // b2h0 = 55
	( 0.3823223304703363 0.01767766952966369 0.0 )	 // a3h0 = 56
	( 0.28509514805718605 0.11490485194281398 0.0 )	 // b3h0 = 57
	( 0.375 3.061616997868383e-18 0.0 )	 // a4h0 = 58
	( 0.23750000000000002 1.9900510486144492e-17 0.0 )	 // b4h0 = 59
	( 0.3823223304703363 -0.017677669529663688 0.0 )	 // a5h0 = 60
	( 0.28509514805718605 -0.11490485194281397 0.0 )	 // b5h0 = 61
	( 0.4 -0.025 0.0 )	 // a6h0 = 62
	( 0.39999999999999997 -0.1625 0.0 )	 // b6h0 = 63
	( 0.41767766952966373 -0.01767766952966369 0.0 )	 // a7h0 = 64
	( 0.514904851942814 -0.114904851942814 0.0 )	 // b7h0 = 65
	( 0.42500000000000004 0.0 0.01 )	 // a0h1 = 66
	( 0.5625 0.0 0.01 )	 // b0h1 = 67
	( 0.41767766952966373 0.017677669529663688 0.01 )	 // a1h1 = 68
	( 0.514904851942814 0.11490485194281397 0.01 )	 // b1h1 = 69
	( 0.4 0.025 0.01 )	 // a2h1 = 70
	( 0.4 0.1625 0.01 )	 // b2h1 = 71
	( 0.3823223304703363 0.01767766952966369 0.01 )	 // a3h1 = 72
	( 0.28509514805718605 0.11490485194281398 0.01 )	 // b3h1 = 73
	( 0.375 3.061616997868383e-18 0.01 )	 // a4h1 = 74
	( 0.23750000000000002 1.9900510486144492e-17 0.01 )	 // b4h1 = 75
	( 0.3823223304703363 -0.017677669529663688 0.01 )	 // a5h1 = 76
	( 0.28509514805718605 -0.11490485194281397 0.01 )	 // b5h1 = 77
	( 0.4 -0.025 0.01 )	 // a6h1 = 78
	( 0.39999999999999997 -0.1625 0.01 )	 // b6h1 = 79
	( 0.41767766952966373 -0.01767766952966369 0.01 )	 // a7h1 = 80
	( 0.514904851942814 -0.114904851942814 0.01 )	 // b7h1 = 81
);




blocks
(
    hex ( 0 10 12 2 1 11 13 3 )   ( 10 16 1 ) simpleGrading ( 1 1 1 )  // 0   ['x0y0z0', 'x1y0z0', 'x1y1z0', 'x0y1z0']
    hex ( 2 12 14 4 3 13 15 5 )   ( 10 16 1 ) simpleGrading ( 1 1 1 )  // 1   ['x0y1z0', 'x1y1z0', 'x1y2z0', 'x0y2z0']
    hex ( 4 14 16 6 5 15 17 7 )   ( 10 16 1 ) simpleGrading ( 1 1 1 )  // 2   ['x0y2z0', 'x1y2z0', 'x1y3z0', 'x0y3z0']
    hex ( 6 16 18 8 7 17 19 9 )   ( 10 16 1 ) simpleGrading ( 1 1 1 )  // 3   ['x0y3z0', 'x1y3z0', 'x1y4z0', 'x0y4z0']
    hex ( 10 20 22 12 11 21 23 13 )   ( 16 16 1 ) simpleGrading ( 1 1 1 )  // 4   ['x1y0z0', 'x2y0z0', 'x2y1z0', 'x1y1z0']
    hex ( 16 26 28 18 17 27 29 19 )   ( 16 16 1 ) simpleGrading ( 1 1 1 )  // 5   ['x1y3z0', 'x2y3z0', 'x2y4z0', 'x1y4z0']
    hex ( 20 30 32 22 21 31 33 23 )   ( 16 16 1 ) simpleGrading ( 1 1 1 )  // 6   ['x2y0z0', 'x3y0z0', 'x3y1z0', 'x2y1z0']
    hex ( 26 36 38 28 27 37 39 29 )   ( 16 16 1 ) simpleGrading ( 1 1 1 )  // 7   ['x2y3z0', 'x3y3z0', 'x3y4z0', 'x2y4z0']
    hex ( 30 40 42 32 31 41 43 33 )   ( 123 16 1 ) simpleGrading ( 1 1 1 )  // 8   ['x3y0z0', 'x4y0z0', 'x4y1z0', 'x3y1z0']
    hex ( 32 42 44 34 33 43 45 35 )   ( 123 16 1 ) simpleGrading ( 1 1 1 )  // 9   ['x3y1z0', 'x4y1z0', 'x4y2z0', 'x3y2z0']
    hex ( 34 44 46 36 35 45 47 37 )   ( 123 16 1 ) simpleGrading ( 1 1 1 )  // 10   ['x3y2z0', 'x4y2z0', 'x4y3z0', 'x3y3z0']
    hex ( 36 46 48 38 37 47 49 39 )   ( 123 16 1 ) simpleGrading ( 1 1 1 )  // 11   ['x3y3z0', 'x4y3z0', 'x4y4z0', 'x3y4z0']
// cylinder block
    hex ( 50 51 53 52 66 67 69 68 )   ( 25 16 1 ) simpleGrading ( 5 1 1 )  // 12   ['a0h0', 'b0h0', 'b1h0', 'a1h0']
    hex ( 51 34 36 53 67 35 37 69 )   ( 12 16 1 ) simpleGrading ( 1 1 1 )  // 13   ['b0h0', 'c0h0', 'c1h0', 'b1h0']
    hex ( 52 53 55 54 68 69 71 70 )   ( 25 16 1 ) simpleGrading ( 5 1 1 )  // 14   ['a1h0', 'b1h0', 'b2h0', 'a2h0']
    hex ( 53 36 26 55 69 37 27 71 )   ( 12 16 1 ) simpleGrading ( 1 1 1 )  // 15   ['b1h0', 'c1h0', 'c2h0', 'b2h0']
    hex ( 54 55 57 56 70 71 73 72 )   ( 25 16 1 ) simpleGrading ( 5 1 1 )  // 16   ['a2h0', 'b2h0', 'b3h0', 'a3h0']
    hex ( 55 26 16 57 71 27 17 73 )   ( 12 16 1 ) simpleGrading ( 1 1 1 )  // 17   ['b2h0', 'c2h0', 'c3h0', 'b3h0']
    hex ( 56 57 59 58 72 73 75 74 )   ( 25 16 1 ) simpleGrading ( 5 1 1 )  // 18   ['a3h0', 'b3h0', 'b4h0', 'a4h0']
    hex ( 57 16 14 59 73 17 15 75 )   ( 12 16 1 ) simpleGrading ( 1 1 1 )  // 19   ['b3h0', 'c3h0', 'c4h0', 'b4h0']
    hex ( 58 59 61 60 74 75 77 76 )   ( 25 16 1 ) simpleGrading ( 5 1 1 )  // 20   ['a4h0', 'b4h0', 'b5h0', 'a5h0']
    hex ( 59 14 12 61 75 15 13 77 )   ( 12 16 1 ) simpleGrading ( 1 1 1 )  // 21   ['b4h0', 'c4h0', 'c5h0', 'b5h0']
    hex ( 60 61 63 62 76 77 79 78 )   ( 25 16 1 ) simpleGrading ( 5 1 1 )  // 22   ['a5h0', 'b5h0', 'b6h0', 'a6h0']
    hex ( 61 12 22 63 77 13 23 79 )   ( 12 16 1 ) simpleGrading ( 1 1 1 )  // 23   ['b5h0', 'c5h0', 'c6h0', 'b6h0']
    hex ( 62 63 65 64 78 79 81 80 )   ( 25 16 1 ) simpleGrading ( 5 1 1 )  // 24   ['a6h0', 'b6h0', 'b7h0', 'a7h0']
    hex ( 63 22 32 65 79 23 33 81 )   ( 12 16 1 ) simpleGrading ( 1 1 1 )  // 25   ['b6h0', 'c6h0', 'c7h0', 'b7h0']
    hex ( 64 65 51 50 80 81 67 66 )   ( 25 16 1 ) simpleGrading ( 5 1 1 )  // 26   ['a7h0', 'b7h0', 'b0h0', 'a0h0']
    hex ( 65 32 34 51 81 33 35 67 )   ( 12 16 1 ) simpleGrading ( 1 1 1 )  // 27   ['b7h0', 'c7h0', 'c0h0', 'b0h0']
);




edges
(
    arc 50 52 ( 0.4230969883127822 0.009567085809127246 0.0 )// cyl block
    arc 51 53 ( 0.5501304240330841 0.06218605775932709 0.0 )// cyl block
    arc 52 54 ( 0.40956708580912726 0.02309698831278217 0.0 )// cyl block
    arc 53 55 ( 0.46218605775932714 0.1501304240330841 0.0 )// cyl block
    arc 54 56 ( 0.3904329141908728 0.02309698831278217 0.0 )// cyl block
    arc 55 57 ( 0.33781394224067296 0.1501304240330841 0.0 )// cyl block
    arc 56 58 ( 0.37690301168721785 0.009567085809127247 0.0 )// cyl block
    arc 57 59 ( 0.24986957596691592 0.06218605775932711 0.0 )// cyl block
    arc 58 60 ( 0.37690301168721785 -0.009567085809127232 0.0 )// cyl block
    arc 59 61 ( 0.2498695759669159 -0.062186057759327 0.0 )// cyl block
    arc 60 62 ( 0.3904329141908728 -0.023096988312782174 0.0 )// cyl block
    arc 61 63 ( 0.33781394224067296 -0.15013042403308413 0.0 )// cyl block
    arc 62 64 ( 0.40956708580912726 -0.023096988312782167 0.0 )// cyl block
    arc 63 65 ( 0.46218605775932714 -0.15013042403308408 0.0 )// cyl block
    arc 64 50 ( 0.4230969883127822 -0.00956708580912724 0.0 )// cyl block
    arc 65 51 ( 0.5501304240330842 -0.062186057759327056 0.0 )// cyl block
    arc 66 68 ( 0.4230969883127822 0.009567085809127246 0.01 )// cyl block
    arc 67 69 ( 0.5501304240330841 0.06218605775932709 0.01 )// cyl block
    arc 68 70 ( 0.40956708580912726 0.02309698831278217 0.01 )// cyl block
    arc 69 71 ( 0.46218605775932714 0.1501304240330841 0.01 )// cyl block
    arc 70 72 ( 0.3904329141908728 0.02309698831278217 0.01 )// cyl block
    arc 71 73 ( 0.33781394224067296 0.1501304240330841 0.01 )// cyl block
    arc 72 74 ( 0.37690301168721785 0.009567085809127247 0.01 )// cyl block
    arc 73 75 ( 0.24986957596691592 0.06218605775932711 0.01 )// cyl block
    arc 74 76 ( 0.37690301168721785 -0.009567085809127232 0.01 )// cyl block
    arc 75 77 ( 0.2498695759669159 -0.062186057759327 0.01 )// cyl block
    arc 76 78 ( 0.3904329141908728 -0.023096988312782174 0.01 )// cyl block
    arc 77 79 ( 0.33781394224067296 -0.15013042403308413 0.01 )// cyl block
    arc 78 80 ( 0.40956708580912726 -0.023096988312782167 0.01 )// cyl block
    arc 79 81 ( 0.46218605775932714 -0.15013042403308408 0.01 )// cyl block
    arc 80 66 ( 0.4230969883127822 -0.00956708580912724 0.01 )// cyl block
    arc 81 67 ( 0.5501304240330842 -0.062186057759327056 0.01 )// cyl block
);




boundary
(

inlet
{
  type patch;
  faces
  (
    ( 0 2 3 1 )  // ['x0y0z0', 'x0y1z0', 'x0y1z1', 'x0y0z1']
    ( 2 4 5 3 )  // ['x0y1z0', 'x0y2z0', 'x0y2z1', 'x0y1z1']
    ( 4 6 7 5 )  // ['x0y2z0', 'x0y3z0', 'x0y3z1', 'x0y2z1']
    ( 6 8 9 7 )  // ['x0y3z0', 'x0y4z0', 'x0y4z1', 'x0y3z1']
  );
}


outlet
{
  type patch;
  faces
  (
    ( 40 42 43 41 )  // ['x4y0z0', 'x4y1z0', 'x4y1z1', 'x4y0z1']
    ( 42 44 45 43 )  // ['x4y1z0', 'x4y2z0', 'x4y2z1', 'x4y1z1']
    ( 44 46 47 45 )  // ['x4y2z0', 'x4y3z0', 'x4y3z1', 'x4y2z1']
    ( 46 48 49 47 )  // ['x4y3z0', 'x4y4z0', 'x4y4z1', 'x4y3z1']
  );
}


cylinder
{
  type wall;
  faces
  (
    ( 50 52 68 66 )  // ['a0h0', 'a1h0', 'a1h1', 'a0h1']
    ( 52 54 70 68 )  // ['a1h0', 'a2h0', 'a2h1', 'a1h1']
    ( 54 56 72 70 )  // ['a2h0', 'a3h0', 'a3h1', 'a2h1']
    ( 56 58 74 72 )  // ['a3h0', 'a4h0', 'a4h1', 'a3h1']
    ( 58 60 76 74 )  // ['a4h0', 'a5h0', 'a5h1', 'a4h1']
    ( 60 62 78 76 )  // ['a5h0', 'a6h0', 'a6h1', 'a5h1']
    ( 62 64 80 78 )  // ['a6h0', 'a7h0', 'a7h1', 'a6h1']
    ( 64 50 66 80 )  // ['a7h0', 'a0h0', 'a0h1', 'a7h1']
  );
}


sides
{
  type patch;
  faces
  (
    ( 0 10 11 1 )  // ['x0y0z0', 'x1y0z0', 'x1y0z1', 'x0y0z1']
    ( 8 18 19 9 )  // ['x0y4z0', 'x1y4z0', 'x1y4z1', 'x0y4z1']
    ( 10 20 21 11 )  // ['x1y0z0', 'x2y0z0', 'x2y0z1', 'x1y0z1']
    ( 18 28 29 19 )  // ['x1y4z0', 'x2y4z0', 'x2y4z1', 'x1y4z1']
    ( 20 30 31 21 )  // ['x2y0z0', 'x3y0z0', 'x3y0z1', 'x2y0z1']
    ( 28 38 39 29 )  // ['x2y4z0', 'x3y4z0', 'x3y4z1', 'x2y4z1']
    ( 30 40 41 31 )  // ['x3y0z0', 'x4y0z0', 'x4y0z1', 'x3y0z1']
    ( 38 48 49 39 )  // ['x3y4z0', 'x4y4z0', 'x4y4z1', 'x3y4z1']
  );
}

);




mergePatchPairs
(
);



// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
